RIET/src/Documents/ЗагрузкаИРаспределениеРасходов/ЗагрузкаИРаспределениеРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаИРаспределениеРасходов</name>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Загрузка</name>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПерсонала</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрочиеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаТВ</name>
      <type>
        <types>CatalogRef.СтрокиТВ</types>
      </type>
    </attributes>
    <attributes>
      <name>FiscalType</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распределение</name>
    <attributes>
      <name>Способ</name>
      <type>
        <types>CatalogRef.СпособыРаспределенияРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>НалоговаяРегистрация</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрочиеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСмит</name>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСтрокТВ</name>
    <attributes>
      <name>СтрокаТВ</name>
      <type>
        <types>CatalogRef.СтрокиТВ</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FiscalType</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеРучное</name>
    <attributes>
      <name>Способ</name>
      <type>
        <types>CatalogRef.СпособыРаспределенияРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаТВ</name>
      <type>
        <types>CatalogRef.СтрокиТВ</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распределять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>VendorName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ApInvoice</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PoNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ItemDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>URN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GltObjId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MgmtNIS_BLSummaryAcct</name>
      <comment>наименование счета Lawson</comment>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountDesc</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ПроводкиDSSОбщие/ПроводкиDSSОбщие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПроводкиDSSОбщие</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>BaseAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>RubAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FiscAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>TempDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PermDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ExchDiff</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>System</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GltObjId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TranAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PeriodLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модуль</name>
    <type>
      <types>EnumRef.МодулиРазработки</types>
    </type>
  </attributes>
  <dimensions>
    <name>AccountLawson</name>
    <type>
      <types>ChartOfAccountsRef.Lawson</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FiscalType</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Enums/МодулиРазработки/МодулиРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МодулиРазработки</name>
  <enumValues>
    <name>FixedAssets</name>
  </enumValues>
  <enumValues>
    <name>PurchaseBook</name>
  </enumValues>
  <enumValues>
    <name>SalesBook</name>
  </enumValues>
  <enumValues>
    <name>Inventory</name>
  </enumValues>
  <enumValues>
    <name>InventoryCosts</name>
  </enumValues>
  <enumValues>
    <name>Importation</name>
  </enumValues>
  <enumValues>
    <name>GL</name>
  </enumValues>
  <enumValues>
    <name>Salary</name>
  </enumValues>
  <enumValues>
    <name>TangibleAssets</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/КостЦентры/КостЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КостЦентры</name>
  <comment>Параллельный с подразделениями учет ОС </comment>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultActivity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnlyMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>NonLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>SubGeomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Documents/ЗагрузкаИРаспределениеРасходов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗагрузкаРасходовПоЗарплатеЗатраты.НалоговаяРегистрация,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗатраты.Расходы) КАК Расходы,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗатраты.ПрочиеРасходы) КАК ПрочиеРасходы,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗатраты.СтраховыеВзносы) КАК СтраховыеВзносы,
	                      |	СУММА(ЗагрузкаРасходовПоЗарплатеЗатраты.ВзносыФСС) КАК ВзносыФСС,
	                      |	ВЫБОР
	                      |		КОГДА ЗагрузкаРасходовПоЗарплатеЗатраты.ВидРасходов = ""прямые расходы""
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК Прямые
	                      |ПОМЕСТИТЬ РасходыОбщие
	                      |ИЗ
	                      |	Документ.ЗагрузкаРасходовПоЗарплате.Затраты КАК ЗагрузкаРасходовПоЗарплатеЗатраты
	                      |ГДЕ
	                      |	ЗагрузкаРасходовПоЗарплатеЗатраты.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗагрузкаРасходовПоЗарплатеЗатраты.НалоговаяРегистрация,
	                      |	ВЫБОР
	                      |		КОГДА ЗагрузкаРасходовПоЗарплатеЗатраты.ВидРасходов = ""прямые расходы""
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РасходыОбщие.НалоговаяРегистрация,
	                      |	РасходыОбщие.Расходы КАК Сумма,
	                      |	&РасходыПрямые КАК Тип
	                      |ПОМЕСТИТЬ ДляСворачивания
	                      |ИЗ
	                      |	РасходыОбщие КАК РасходыОбщие
	                      |ГДЕ
	                      |	РасходыОбщие.Прямые
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РасходыОбщие.НалоговаяРегистрация,
	                      |	РасходыОбщие.Расходы,
	                      |	&РасходыРаспр
	                      |ИЗ
	                      |	РасходыОбщие КАК РасходыОбщие
	                      |ГДЕ
	                      |	(НЕ РасходыОбщие.Прямые)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РасходыОбщие.НалоговаяРегистрация,
	                      |	РасходыОбщие.ПрочиеРасходы,
	                      |	&ПрочиеРасходы
	                      |ИЗ
	                      |	РасходыОбщие КАК РасходыОбщие
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РасходыОбщие.НалоговаяРегистрация,
	                      |	РасходыОбщие.СтраховыеВзносы,
	                      |	&ЕСНпрямой
	                      |ИЗ
	                      |	РасходыОбщие КАК РасходыОбщие
	                      |ГДЕ
	                      |	(НЕ РасходыОбщие.Прямые)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РасходыОбщие.НалоговаяРегистрация,
	                      |	РасходыОбщие.СтраховыеВзносы,
	                      |	&ЕСНраспр
	                      |ИЗ
	                      |	РасходыОбщие КАК РасходыОбщие
	                      |ГДЕ
	                      |	РасходыОбщие.Прямые
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РасходыОбщие.НалоговаяРегистрация,
	                      |	РасходыОбщие.ВзносыФСС,
	                      |	&ФСС
	                      |ИЗ
	                      |	РасходыОбщие КАК РасходыОбщие
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МИНИМУМ(КостЦентры.Ссылка) КАК Ссылка,
	                      |	КостЦентры.TaxRegistration
	                      |ПОМЕСТИТЬ АУ
	                      |ИЗ
	                      |	Справочник.КостЦентры КАК КостЦентры
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КостЦентры.TaxRegistration
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВложенныйЗапрос.НалоговаяРегистрация,
	                      |	ВложенныйЗапрос.Сумма,
	                      |	ВложенныйЗапрос.Тип,
	                      |	АУ.Ссылка КАК AU
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ДляСворачивания.НалоговаяРегистрация КАК НалоговаяРегистрация,
	                      |		СУММА(ДляСворачивания.Сумма) КАК Сумма,
	                      |		ДляСворачивания.Тип КАК Тип
	                      |	ИЗ
	                      |		ДляСворачивания КАК ДляСворачивания
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ДляСворачивания.НалоговаяРегистрация,
	                      |		ДляСворачивания.Тип) КАК ВложенныйЗапрос
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ АУ КАК АУ
	                      |		ПО ВложенныйЗапрос.НалоговаяРегистрация = АУ.TaxRegistration");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("РасходыПрямые",	Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("SAL_dir"));
	Запрос.УстановитьПараметр("РасходыРаспр",  	Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("SAL_reall"));
	Запрос.УстановитьПараметр("ПрочиеРасходы",  Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("SAL_Other"));
	Запрос.УстановитьПараметр("ЕСНпрямой",  	Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("SAL_UST_d"));
	Запрос.УстановитьПараметр("ЕСНраспр",  		Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("SAL_UST_r"));
	Запрос.УстановитьПараметр("ФСС",  			Справочники.СтатьиДоходовИРасходов.НайтиПоКоду("SAL_SIF"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	курсSLB = ОбщегоНазначения.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("999"), Дата).Курс;
	
	
	Пока выборка.Следующий() Цикл
		Движение = Движения.ПроводкиDSSОбщие.Добавить();
		Движение.Период = Дата;
		//Движение.AccountLawson = ПланыСчетов.Lawson.НайтиПоКоду("529703");
		Движение.AU = Выборка.AU;
		Движение.LegalEntity = Выборка.НалоговаяРегистрация;
		Движение.FiscalType = Выборка.Тип;
		Движение.BaseAmount = 0;
		Движение.RubAmount = Выборка.Сумма;
		Движение.FiscAmount = Выборка.Сумма / курсSLB;
		Движение.PermDiff =  - Движение.FiscAmount;
		Движение.Currency = Справочники.Валюты.НайтиПоКоду("643");
		Движение.Description = "расходы на оплату труда"; 	
		Движение.GltObjId = 1000000000;
		Движение.GUID = Новый УникальныйИдентификатор;
		Движение.Модуль = Перечисления.МодулиРазработки.Salary;
	КонецЦикла;
	
	Движения.ПроводкиDSSОбщие.Записать();
	
КонецПроцедуры

Функция ВернутьВидыНачислений(ТЗ) Экспорт 
	
	СтрокаЗаголовков = ТЗ[0];
	КолВоКолонок = ТЗ.Колонки.Количество();
	ТабЗаголовков = Новый ТаблицаЗначений;
	ТабЗаголовков.Колонки.Добавить("Заголовок", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100));
	Для индК = 1 По КолВоКолонок Цикл
		ЗаголовокКолонки = СтрокаЗаголовков[индК-1]; 
		НоваяСтрока = ТабЗаголовков.Добавить();
		НоваяСтрока.Заголовок = ЗаголовокКолонки;
		//Сообщить(НоваяСтрока.Заголовок);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ                                           
		|	ТабЗаголовков.Заголовок 
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТабЗаголовков КАК ТабЗаголовков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Заголовок КАК ВидНачисления
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНачислений КАК ВидыНачислений
		|		ПО ВТ.Заголовок = ВидыНачислений.Наименование
		|ГДЕ
		|	ВидыНачислений.Ссылка ЕСТЬ NULL ";
		
	Запрос.УстановитьПараметр("ТабЗаголовков", ТабЗаголовков);	

	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции
